Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: ཕྱོགས་བཅུ་གཞན་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་ཏུ་བདག་གི་ལུས་མཚན་གྱིས་བརྒྱན་པ་གདའ་བར་གྱུར་ཅིག །
en: May my body, which will be adorned by the signs of a great being, be visible in as many realms in the ten directions as there are particles in a thousand buddha realms.

source: དེ་ན་སེམས་ཅན་གང་དག་གིས་བདག་མཐོང་བར་གྱུར་པའི་སེམས་ཅན་དེ་དག་གི་འདོད་ཆགས་རབ་ཏུ་ཞི་བར་གྱུར་ཅིག །ཞེ་སྡང་དང་། གཏི་མུག་དང་།
en: When the beings there see me, may their desires cease.

source: ཕྲག་དོག་དང་། ང་རྒྱལ་དང་། འཆབ་པ་དང་། ཉོན་མོངས་པ་དང་། ཉེ་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་གྱུར་ཅིག །
en: May all their anger, ignorance, envy, pride, hypocrisy, kleśas, and subsidiary kleśas cease completely.

source: ཐམས་ཅད་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་གྱུར་ཅིག ། ཏིང་ངེ་འཛིན་དང་།
en: May they all develop the aspiration for enlightenment.

source: གཟུངས་ཀྱི་སྒོ་རྣམ་པ་ཇི་ལྟ་བུ་དག་འཚལ་བ་དེ་ལྟ་བུ་དག་ཀྱང་བདག་མཐོང་བས་ཐོབ་པར་གྱུར་ཅིག །
en: Through seeing me may they attain whatever samādhis and dhāraṇīs they were seeking.

source: དེ་ན་སེམས་ཅན་གང་དག་གྲང་བའི་སེམས་ཅན་དམྱལ་བར་སྐྱེས་པར་གྱུར་པ་དེ་དག་གིས་ཀྱང་བདག་མཐོང་བས་བདེ་བའི་ཚོར་བ་འབྱུང་བར་འགྱུར་ཞིང་། འདི་ལྟ་སྟེ་དཔེར་བགྱི་ན་དགེ་སློང་བསམ་གཏན་གཉིས་པ་ལ་སྙོམས་པར་ཞུགས་པ་དེ་ལྟ་བུའི་བདེ་བའི་ཚོར་བ་ཐོབ་པར་གྱུར་ཅིག །
en: When the beings reborn in the cold hells see me, may they experience bliss, a bliss that is like that of a bhikṣu in the meditation of the second dhyāna.

source: དེ་དག་གིས་བདག་མཐོང་ནས་ལུས་དང་སེམས་ཀྱི་བདེ་བ་མཆོག་དང་ལྡན་པར་གྱུར་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་གྱུར་ཅིག །
en: When they see me, may they have perfect physical and mental bliss and develop the aspiration for the highest, most complete enlightenment.

source: དེ་དག་དེ་ནས་ཤི་འཕོས་ནས་ཀྱང་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བར་འགྱུར་ཞིང་། དེར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་སླར་མི་ལྡོག་པར་གྱུར་ཅིག །
en: When they die in those hells, may they be reborn in my buddha realm and not turn back from the highest, most complete enlightenment. “ ‘

source: སེམས་ཅན་གང་དག་ཡི་དགས་ཀྱི་གནས་རྣམས་སུ་སྐྱེས་པར་གྱུར་པ་དག་གིས་ཀྱང་བདག་མཐོང་བར་གྱུར་ཅིང་སྔ་མ་བཞིན་དུ་གྱུར་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་སླར་མི་ལྡོག་པར་གྱུར་ཅིག །
en: When beings born in the world of the pretas see me, may the same happen to them and may they never turn back from the highest, most complete enlightenment.

source: དེ་བཞིན་དུ་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སྐྱེས་པ་རྣམས་ལ་ཡང་བརྗོད་པར་བགྱིའོ།
en: May it be the same for those who have been born as animals.

source: །ལྷ་རྣམས་ལ་ཡང་དེ་བཞིན་དུ་སྦྱར་ཏེ། བདག་གི་འོད་ཀྱང་ཉིས་གྱུར་དུ་སྣང་བར་གྱུར་ཅིག །
en: May my light be twice as bright for those born as devas. “ ‘

source: བདག་གི་ཚེ་ཡང་དཔག་ཏུ་མ་མཆིས་པར་འགྱུར་ལ། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མ་གཏོགས་པར་སུས་ཀྱང་བགྲང་བར་རྔོ་མི་ཐོགས་པར་གྱུར་ཅིག །
en: May I have a measureless lifespan, which no one, except for the omniscient, will be able to comprehend.

source: བདག་བྱང་ཆུབ་ཐོབ་པ་ན་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མ་མཆིས་གྲངས་མ་མཆིས་དཔག་ཏུ་མ་མཆིས་པ་གཞན་དག་གི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་གིས་གང་དག་བསྒྲགས་པར་འགྱུར་བ་བདག་གི་བསྔགས་པ་རྗོད་པར་གྱུར་ཅིག །
en: When I attain enlightenment, may the bhagavat buddhas in incalculable, countless, innumerable worlds in the ten directions praise me.

source: དེ་ན་སེམས་ཅན་གང་དག་གིས་བདག་གི་བསྔགས་པ་ཐོས་པར་གྱུར་པ་དེ་དག་ཀྱང་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྔོ་བར་གྱུར་ཅིག །
en: When the beings in those worlds hear these praises of me, may they dedicate all their good roots to rebirth in my buddha realm.

source: དེ་དག་འགུམ་པའི་དུས་བགྱིས་ནས་ཀྱང་མཚམས་མ་མཆིས་པ་བགྱིད་པ་རྣམས་དང་། དམ་པའི་ཆོས་སྤོང་བ་རྣམས་དང་། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ་རྣམས་མ་གཏོགས་པ་དག་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བར་གྱུར་ཅིག །
en: May they be reborn in my buddha realm when they die, unless they have committed the actions with immediate results at death, or abandoned the Dharma, or maligned a higher being. “ ‘

source: བདག་བྱང་ཆུབ་ཐོབ་པ་ན་གང་དག་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མ་མཆིས་གྲངས་མ་མཆིས་པ་དག་གི་སེམས་ཅན་རྣམས་ཀྱིས་བདག་གི་མིང་ཐོས་པར་འགྱུར་ཞིང་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བ་འཚལ་བར་གྱུར་ཅིག །
en: When I attain enlightenment, may beings in countless, innumerable worlds hear my name and wish to be reborn in my buddha realm.

source: དེ་དག་འགུམ་པའི་དུས་ཀྱི་ཚེ་ན་ཡང་བདག་ཚོགས་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་རབ་རིབ་མ་མཆིས་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས། གང་སེམས་ཅན་དེ་དག་གི་སྡུག་བསྔལ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར་བ་དེ་ལྟ་བུའི་ལེགས་པ་བཤད་པས་སེམས་ཅན་དེ་དག་ཚིམ་པར་བགྱིད་པར་གྱུར་ཅིག །
en: When they are dying, may I, encircled by a great retinue, resting in the freedom from darkness samādhi, satisfy those beings with excellent teaching and end their suffering.

source: དད་པ་དེ་ཉིད་ཀྱིས་སེམས་མེད་པ་ཞེས་བགྱི་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་གྱུར་ཅིག །སེམས་དགའ་བའི་ཆོས་ཀྱིས་བཟོད་པ་ཡང་ཐོབ་པར་གྱུར་ཅིག །འགུམ་པའི་དུས་བགྱིས་ནས་ཀྱང་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བར་གྱུར་ཅིག །སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དག་ན་སེམས་ཅན་གང་དག་ནོར་བདུན་དང་བྲལ་བ་རྣམས་དང་། ཐེག་པ་གསུམ་དོན་དུ་མི་གཉེར་བ་རྣམས་དང་། ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་དག་དོན་དུ་མི་གཉེར་བ་རྣམས་དང་། དགེ་བ་ཡོངས་སུ་བཙལ་བ་དོན་དུ་མི་གཉེར་བ་རྣམས་དང་།
en: Through their faith in me may they attain a samādhi free of thought, may they realize the acceptance of phenomena that delights the mind, and, when they die, may they be reborn in my buddha realm. “ ‘

source: བསོད་ནམས་བགྱི་བའི་དངོས་པོ་གསུམ་པོ་དོན་དུ་མི་གཉེར་བ་རྣམས་དང་། ཆོས་མ་ལགས་པ་དང་། འདོད་ཆགས་ལ་ཆགས་པ་རྣམས་དང་། འདོད་པ་མི་བཟད་པས་ཟིལ་གྱིས་ནོན་པ་རྣམས་དང་། ཆོས་ལོག་པས་སེམས་དཀྲིས་པ་དེ་དག་འགུམ་པའི་དུས་ཀྱི་ཚེ་ན་བདག་ཚོགས་དུ་མས་ཡོངས་སུ་བསྐོར་ཏེ་མདུན་དུ་མཆིས་ནས་འོད་དང་ཏིང་ངེ་འཛིན་གྱིས་ཆོས་སྟོན་པར་གྱུར་ཅིག །
en: When beings in other realms are dying—those who are devoid of the seven riches who do not aspire to the three yānas, who do not aspire to the good fortune of devas and humans, who do not aspire to acquiring virtue, who do not aspire to the three methods of accumulating merit, who are attached to desires and what is not Dharma, who are overwhelmed by overpowering greed, who are under the sway of a wrong Dharma—then at that time may I, accompanied by a great retinue, appear through the brightness samādhi and teach them the Dharma.

source: དེ་དག་ལ་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་སྟོན་པར་གྱུར་ཅིག །
en: May I show them my buddha realm.

source: བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་སྩོལ་པར་ཡང་གྱུར་ཅིག །
en: May I cause them to aspire to enlightenment.

source: སེམས་ཅན་དེ་དག་ཀྱང་བདག་ལ་མཆོག་ཏུ་དགའ་ཞིང་དད་པ་ཐོབ་པར་གྱུར་ནས་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་གྱུར་ཅིག །
en: May those beings feel the greatest joy and faith toward me and develop the aspiration for enlightenment.

source: དེ་དག་གི་སྡུག་བསྔལ་གྱི་ཚོར་བ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་གྱུར་ཅིག །
en: May all their sensations of suffering cease.

source: དེ་དག་གིས་ཏིང་ངེ་འཛིན་ཉི་མའི་སྒྲོན་མ་ཐོབ་པར་གྱུར་ནས་གཏི་མུག་སྤངས་པར་གྱུར་ཅིག །
en: May they attain the lamp of the sun samādhi and eliminate their ignorance.

source: དེ་དག་འགུམ་པའི་དུས་བགྱིས་ནས་ཀྱང་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བར་གྱུར་ཅིག །
en: When they die, may they be reborn in my buddha realm.’ “

source: །ཁྱོད་ཀྱིས་ནི་སྨོན་ལམ་བཟང་པོར་བཏབ་བོ།
en: The prayer you made is magnificent.’ “

source: །དེས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་སྨོན་ལམ་དེ་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན་དེའི་སླད་དུ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དག་ཏུ་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་ཕྱེ་མའི་ཆར་རབ་ཏུ་འབབ་པར་གྱུར་ཅིག །
en: Then Prince Aṅgaja declared, ‘Bhadanta Bhagavat, if this prayer of mine is to be fulfilled, may there fall a rain of uragasāra sandalwood powder in other buddha realms in the ten directions as numerous as the particles in a buddha realm.

source: སེམས་ཅན་གང་དག་གིས་དྲི་དེ་ཚོར་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་གྱུར་ཅིག །
en: May all the beings who smell that scent develop the aspiration for the highest, most complete enlightenment.

source: བདག་གིས་ཀྱང་ཏིང་ངེ་འཛིན་གྱ་ནོམ་སྣང་ཞེས་བགྱི་བ་ཐོབ་པར་གྱུར་ཅིག །དེ་ཡང་བདག་ཉིད་ཀྱིས་མཐོང་བར་གྱུར་ཅིག །
en: May I attain the samādhi called sublime splendor and see that happen myself.’ “

source: རིགས་ཀྱི་བུ་དེས་ཏིང་ངེ་འཛིན་གྱ་ནོམ་སྣང་བ་བསྐྱེད་པ་དང་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་ཏུ་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་ཕྱེ་མའི་ཆར་བབ་པ་དེ་ཡང་བདག་ཉིད་ཀྱིས་མཐོང་ལ་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེར་ཡང་སེམས་ཅན་བགྲང་བ་ལས་འདས་པ་གང་དག་གི་ཐལ་མོ་སྦྱར་ཏེ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དག་ཀྱང་མཐོང་བ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Then, noble son, he developed the sublime splendor samādhi, and he saw that it rained uragasāra sandalwood powder in other realms in the ten directions, as numerous as the particles in a buddha realm, and saw that countless beings in each of the ten directions placed their palms together and developed the aspiration for enlightenment. “

source: རིགས་ཀྱི་བུ་ཤིན་ཏུ་མྱུར་བར་སྤོས་ཀྱི་ཆར་ཡང་བབ་ལ་སེམས་ཅན་བགྲང་བ་ལས་འདས་པ་དག་ཀྱང་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་པས་ན་རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ཁྱོད་སེང་གེ་སྤོས་ཞེས་བྱ་བར་གྱུར་ཅིག །
en: The Bhagavat said, ‘Noble son, a rain of incense quickly fell, and countless beings have been inspired toward enlightenment. Therefore, noble son, you should be known as Siṃhagandha. “ ‘

source: སེང་གེ་སྤོས་ཁྱོད་ནི་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་འདས་ནས་གྲངས་མེད་པ་གཉིས་པ་ལ་བབ་པ་ན་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བཞི་བཅུ་རྩ་གཉིས་ཀྱི་བྱེ་མ་སྙེད་ཀྱི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་འདས་པ་དེར་འཇིག་རྟེན་གྱི་ཁམས་དྲི་སྔོ་སྣང་བ་རྡུལ་བྲལ་ཞེས་བྱ་བ་ཞིག་འབྱུང་སྟེ།
en: Siṃhagandha, after one incalculable eon has passed, in which there are as many years as there are grains of sand in the Ganges River, at the start of the second eon, there will be in the eastern direction, beyond as many buddha realms as there are particles in buddha realms as numerous as the grains of sand in forty-two Ganges Rivers, a world realm called Nīlagandha­prabhāsavi­raja.

source: སེང་གེ་སྤོས་ཁྱོད་ནི་དེར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: You, Siṃhagandha, will attain the complete enlightenment of perfect buddhahood there.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྣང་བ་རྡུལ་བྲལ་སྤོས་མཐོ་དབང་ཕྱུག་རྒྱལ་པོ་ཞེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འགྱུར་རོ།
en: You will become the tathāgata arhat samyaksam­buddha named Prabhāsavirajaḥ­samucchraya­gandheśvara­rāja.’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེང་གེའི་སྤོས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་ཡན་ལག་ལྔས་ཕྱག་བྱས་པ་དང་།
en: Then, noble son, the bodhisattva Siṃhagandha bowed down the five parts of his body to the feet of the Tathāgata Ratnagarbha. “

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་དེ་ལ་བཀའ་སྩལ་པ། ལྷ་མི་ལྷ་མིན་རྣམས་ཀྱིས་མཆོད་པར་འགྱུར་བ་ལོངས།
en: The Tathāgata Ratnagarbha said to him: “ ‘Arise, you whom devas, humans, and asuras worship!

source: །སྲིད་པའི་འགྲོ་བར་སེམས་ཅན་སྡུག་བསྔལ་ཁྱོད་ཀྱིས་སྒྲོལ།
en: Liberate beings in the existences from their suffering!

source: །སྲིད་པའི་སྡུག་བསྔལ་ཉོན་མོངས་འཆིང་བ་ཁྱོད་ཀྱིས་ཆོད། །མི་ཡི་རྒྱལ་བ་འཕགས་པའི་གང་ཟག་ཉིད་དུ་འགྱུར།
en: Cut through the bondage of existences’ kleśas and suffering, And you will become a human jina, a higher individual!’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་རྒྱལ་བུ་བརྒྱད་པ་གནོད་པ་མེད་ཅེས་བྱ་བ་ལ་སྔ་མ་བཞིན་དུ་སྦྱར་རོ།
en: Then, noble son, the brahmin Samudrareṇu spoke to the eighth prince, who was named Amigha, and it proceeded as before.

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ནི་ཇི་སྲིད་དུ་སངས་རྒྱས་ཀྱི་ཞིང་ཉོན་མོངས་པ་ཅན་ཁྲི་སངས་རྒྱས་ཀྱི་ཞིང་དྲི་སྔོ་སྣང་བ་རྡུལ་བྲལ་ཅི་འདྲ་བར་གྱུར་པ་དེ་ལྟར་ཡོངས་སུ་དག་པར་འགོད་པར་འགྱུར་ཞིང་དེ་དེ་ལྟར་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དང་།
en: Prince Amigha said, ‘Bhadanta Bhagavat, as a bodhisattva I will perform the conduct of a bodhisattva in the afflicted buddha realm such that I will purify ten thousand afflicted buddha realms and so that they become like the buddha realm Nīlagandha­prabhāsavi­raja.

source: བསམ་པ་ཡོངས་སུ་དག་པ་དང་། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དག་གིས་ཁྱབ་པར་གནས་པར་འགྱུར་བ་སྲིད་དུ་བྱང་ཆུབ་སེམས་དཔར་གྱུར་ཅིང་།
en: I will cause them to be filled with bodhisattvas set out on the Mahāyāna who have planted the appropriate good roots and have pure motivation.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཉོན་མོངས་པ་ཅན་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་ན་སླད་ཀྱིས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བགྱི་སྟེ།
en: Subsequently, I will attain the complete enlightenment of perfect buddhahood.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གིས་ནི་ཅི་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དག་མི་སྤྱོད་པ་དེ་ལྟ་བུའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་པར་བགྱིའོ།
en: Bhadanta Bhagavat, I shall accomplish such bodhisattva conduct that no other bodhisattvas have ever performed. “ ‘

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་གང་གི་ཚེ་བདག་ལོ་བདུན་པོ་འདི་ལ་གཅིག་པུ་དབེན་པར་མཆིས་ནས་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ཡོངས་སུ་དག་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་ཡོངས་སུ་དག་པ་ལ་སེམས་ཤིང་མཆིས་པ་ན།
en: Bhadanta Bhagavat, during these seven years that I have been in solitude I have contemplated the pure qualities of the buddhas and bodhisattvas and the pure qualities of the buddha realms.

source: བདག་གིས་ཏིང་ངེ་འཛིན་སྣང་བ་བཀོད་པ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཁྲི་ཆིག་སྟོང་བསྐྱེད་ཅིང་ཐོབ་སྟེ་བསྒོམས་པ་གང་ལགས་པ་དེ་དག་ནི་བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལགས་སོ།
en: I have developed, attained, and meditated in eleven thousand bodhisattva samādhis, such as the vision array samādhi. Bhadanta Bhagavat, this has been my bodhisattva activity now that I am a bodhisattva. “ ‘

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མ་མཆིས་པ་དག་ན་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་སེམས་ཅན་རྣམས་ལ་སྨན་པ་དང་བདེ་བའི་སླད་དུ་ཆོས་སྟོན་པ་དེ་དག་དང་། གང་དག་དུས་གསུམ་ལས་ཡང་དག་པར་འདས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་རྒྱལ་མཚན་གྱི་རྩེ་མོའི་དཔུང་རྒྱན་ཅེས་བགྱི་བ་རྒྱལ་བ་རྣམས་ཀྱིས་ཡོངས་སུ་གཏམས་པ་དེ་དག་མཐོང་ཞིང་དེར་འཇུག་པར་གྱུར་ཅིག །
en: May I see and enter the endless, limitless world realms in the ten directions where bhagavat buddhas who reside, live, and remain, teaching the Dharma for the welfare and happiness of beings, and the buddha realms called Dhvajāgrākeyūra, which transcend the three times and are filled with jinas.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་དེས་བདག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་དང་། ཉན་ཐོས་ཀྱི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་མཐོང་བར་གྱུར་ཅིག །
en: May I, through that samādhi, see the bhagavat buddhas, as numerous as particles, surrounded by assemblies of bodhisattvas and śrāvakas.

source: ཏིང་ངེ་འཛིན་གྱི་མཐུས་བདག་གནས་མ་མཆིས་པར་སངས་རྒྱས་ཀྱི་ཞིང་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་ལུས་ཀྱིས་རེ་རེ་ལ་ཡང་ཕྱག་འཚལ་བར་གྱུར་ཅིག །རེ་རེ་ལ་ཡང་བདག་གི་ལུས་རེ་རེས་རིན་པོ་ཆེ་དང་། མེ་ཏོག་སྣ་ཚོགས་བླ་ན་མ་མཆིས་པ་དག་དང་། སྤོས་དང་།
en: May I, through the power of the unattached samādhi, pay homage to each one of them with bodies as numerous as the particles in a buddha realm.

source: མེ་ཏོག་ཕྲེང་དང་། ཕྱེ་མ་དང་། བྱུག་པ་དང་། རོལ་མོའི་སྒྲ་བླ་ན་མ་མཆིས་པ་སྣ་ཚོགས་དང་། བཀོད་པ་བླ་ན་མ་མཆིས་པ་ཐམས་ཅད་ཀྱིས་མཆོད་པར་གྱུར་ཅིག །
en: May each one of my bodies offer each of them manifold unsurpassable jewels and flowers, manifold unsurpassable incenses, garlands, powders, ointments, and music, all in unsurpassable arrays.

source: སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ཏུ་ཡང་བདག་བསྐལ་པ་རྒྱ་མཚོ་བྱེ་མ་སྙེད་དུ་སྤྱོད་པར་གྱུར་ཅིག །
en: May I perform this in each buddha realm for eons as numerous as the grains of sand in the ocean. “ ‘

source: གང་གི་ཚེ་བདག་གིས་ལུས་ཐམས་ཅད་རྣམ་པར་འཇིག་པའི་ཏིང་ངེ་འཛིན་གྱིས་སྐད་ཅིག་གཅིག་གིས་སངས་རྒྱས་རེ་རེའི་སངས་རྒྱས་ཀྱི་སྤྱོད་ཡུལ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་འཚལ་བར་གྱུར་ཅིག །
en: May I, through the manifesting all bodies samādhi, see, in an instant, the fields of buddha activity of every buddha, which are as numerous as the particles in a buddha realm. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་ཡོན་ཏན་འབྱུང་གནས་ཀྱིས་དེ་དག་རེ་རེ་ལ་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་བསྟོད་པ་བླ་ན་མ་མཆིས་པ་དག་གིས་སྟོད་པར་གྱུར་ཅིག །
en: Bhadanta Bhagavat, may I, through the source of qualities samādhi, praise each buddha with unsurpassable praises as numerous as the particles in a buddha realm. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གིས་མིག་མི་འཛུམས་པའི་ཏིང་ངེ་འཛིན་གྱིས་རྡུལ་གཅིག་གི་སྟེང་དུ་སེམས་ཀྱི་སྐད་ཅིག་གི་ཚད་ཀྱིས་རྒྱལ་བ་རྣམས་ཀྱིས་བལྟམས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་མཐོང་བར་གྱུར་ཅིག །
en: Bhadanta Bhagavat, may I, through the unclosing eyes samādhi, in one instant of mind see all the buddha realms filled with victorious ones upon a single particle. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གིས་ཉོན་མོངས་པ་མ་མཆིས་པའི་ཏིང་ངེ་འཛིན་གྱིས་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དག་ན་འདས་པ་དང་། མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དག་མཐོང་བར་གྱུར་ཅིག །
en: Bhadanta Bhagavat, may I, through the free from conflict samādhi, in one instant of mind see all the past, present, and future bodhisattvas in all the buddha realms and the arrays of qualities of the buddha realms. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་གྱིས་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་ཞུགས་ཏེ། སེམས་ཅན་དམྱལ་བ་པའི་ལུས་སུ་སྤྲུལ་ནས། སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་སྩོལ་བར་གྱུར་ཅིག །
en: Bhadanta Bhagavat, may I, through the heroic samādhi, enter the hells, take on the form of an inhabitant of hell, teach the Dharma to the beings in hell, and inspire them toward enlightenment.

source: དེ་ན་སེམས་ཅན་དེ་དག་ཀྱང་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་གྱུར་ཅིག །
en: May the beings there develop the aspiration for enlightenment.

source: དེ་ནས་ཤི་འཕོས་ནས་ཀྱང་མི་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེ་བར་འགྱུར་ཞིང་གང་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་བཞུགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལས་ཆོས་ཉན་པར་འགྱུར་བ་དང་། ཕྱིར་མི་ལྡོག་པའི་ས་ལ་གནས་པར་གྱུར་ཅིག །དུད་འགྲོ་རྣམས་ལ་ཡང་དེ་བཞིན། ཡི་དགས་རྣམས་ལ་ཡང་དེ་བཞིན། གནོད་སྦྱིན་རྣམས་ལ་ཡང་དེ་བཞིན། སྲིན་པོ་རྣམས་ལ་ཡང་དེ་བཞིན། ལྷ་མ་ཡིན་རྣམས་ལ་ཡང་དེ་བཞིན། ཀླུ་རྣམས་ལ་ཡང་དེ་བཞིན། མིའམ་ཅི་རྣམས་ལ་ཡང་དེ་བཞིན། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་ལ་ཡང་དེ་བཞིན། ཤ་ཟ་རྣམས་ལ་ཡང་དེ་བཞིན། སྲུལ་པོ་རྣམས་ལ་ཡང་དེ་བཞིན། ལུས་སྲུལ་པོ་རྣམས་ལ་ཡང་དེ་བཞིན། མི་གདོལ་པ་རྣམས་ལ་ཡང་དེ་བཞིན། ཚོང་པ་རྣམས་དང་།
en: Then, after passing away, may they be reborn as human beings and wherever buddha bhagavats may be, may they hear the Dharma from those buddha bhagavats, and may they be brought to the level of irreversibility. “ ‘

source: སྨད་འཚོང་མ་རྣམས་ལ་ཡང་དེ་བཞིན་ཏེ། བཅོམ་ལྡན་འདས་སེམས་ཅན་རིགས་ཇི་ལྟ་བུར་སྐྱེས་པ་རྣམས་དང་། དེ་དག་གིས་ལུས་ཇི་ལྟ་བུ་ཐོབ་པ་དང་། སེམས་ཅན་ལས་ཀྱི་རྐྱེན་ཇི་ལྟ་བུས་བདེ་བའམ། སྡུག་བསྔལ་གྱི་ཚོར་བ་མྱོང་བ་རྣམས་དང་།
en: May I emanate bodies that resemble animals, pretas, yakṣas, rākṣasas, asuras, nāgas, kinnaras, mahoragas, piśācas, pūtanas, and kaṭapūtanas, and, similarly, caṇḍālas, merchants, and courtesans, Bhagavat, in accord with the families that beings are born in, in accord with the bodies they have obtained, in accord with the happiness or suffering that they experience because of their karma, in accord with their skills in crafts, and in accord with the work that they do.

source: བཟོའི་གནས་ཇི་ལྟ་བུ་དག་དང་། ལས་ཀྱི་གནས་ཇི་ལྟ་བུ་དག་ལ་ཆགས་པ་རྣམས་ལ་དེ་ལྟ་བུའི་ལུས་སུ་སྤྲུལ་ནས། བཟོའི་གནས་དང་། ལས་ཀྱི་གནས་དེ་ལྟ་བུ་དག་ལ་བརྩོན་པ་སྟོན་པར་བགྱིད་ཅིང་། དེ་ལྟ་བུའི་ཡི་གེ་བརྗོད་པས་སེམས་ཅན་རྣམས་ཀྱི་སེམས་མགུ་བར་བགྱིད་ཅིང་ཆོས་ཀྱང་སྟོན་པར་གྱུར་ཅིག །
en: May I manifest being diligent in those crafts and that work, and through using appropriate words may I please those beings and teach them the Dharma.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ཅིང་བཙུད་པ་དང་རབ་ཏུ་འགོད་པར་ཡང་གྱུར་ཅིག །
en: May I make them aspire to, be intent upon, and be set upon the highest, most complete enlightenment.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་སླར་མི་ལྡོག་པ་ལ་འགོད་པར་ཡང་གྱུར་ཅིག །
en: And may I establish them in irreversible progress toward the highest, complete most enlightenment. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གིས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུ་པོ་ཐམས་ཅད་དག་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་རྒྱུད་ལ་ཡང་ཅི་ནས་ཀྱང་སྔོན་གྱི་ལས་དང་། ཉོན་མོངས་པ་མ་ལུས་པར་འགྱུར་བ་དང་། སེམས་ཅན་འགའི་སེམས་ཀྱི་རྒྱུད་ཀྱི་ལམ་ཡང་བདུད་བཞིས་རྟོགས་པར་མི་འགྱུར་བ་དེ་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་རྒྱུད་ཡོངས་སུ་སྦྱོང་བར་འགྱུར་བ་དེ་སྲིད་དུ་བདག་གིས་བྱང་ཆུབ་ཀྱི་སྤྱོད་པ་སྤྱད་པར་བགྱིའོ།
en: Bhadanta Bhagavat, may I engage in the conduct of a bodhisattva until I purify, by any means whatsoever, the continuums of the minds of all beings in ten thousand buddha realms in the ten directions, so that there will be no karma and kleśas, without exception, in the mental continuums of those beings, and there will not be even a few beings whose paths of mental continuums are conceptualized via the four māras.

source: །དེའི་སླད་དུ་བདག་གིས་སངས་རྒྱས་ཀྱི་ཁྲི་ཡང་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་སྣང་བ་རྡུལ་བྲལ་སྤོས་མཐོ་དབང་ཕྱུག་རྒྱལ་པོ་སྐར་མའི་སངས་རྒྱས་ཀྱི་ཞིང་དྲི་སྔོ་སྣང་བ་རྡུལ་བྲལ་གྱི་ཡོན་ཏན་བཀོད་པ་ཅི་འདྲ་བ་དེ་ལྟར་ཡོངས་སུ་དག་པར་འཇོག་པར་གྱུར་ཅིག །
en: For that purpose, may I purify those ten thousand buddha realms so that they have the same array of qualities as Nīlagandha­prabhāsavi­raja, the realm of the Tathāgata Prabhāsavirajaḥ­samucchraya­gandheśvara­rāja.

source: དེ་བཞིན་དུ་བདག་གིས་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དང་། བདག་གི་འཁོར་ཡང་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེང་གེ་སྤོས་ཀྱིས་སྨོན་ལམ་བཏབ་པ་བཞིན་དུ་གྱུར་ཅིག །
en: May my buddha realm and my retinue thus be just as the bodhisattva Siṃhagandha prayed for. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན་དེའི་སླད་དུ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་དག་གི་སེམས་ཅན་རྣམས་ཀྱི་སྡུག་བསྔལ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་གྱུར་ཅིག །
en: Bhadanta Bhagavat, if this wish of mine is to be completely fulfilled, may all the suffering of beings in the buddha realms in the ten directions be appeased.

source: ཐམས་ཅད་ཀྱང་སེམས་མཉེན་པར་གྱུར་ཅིག །
en: May they all have gentle minds.

source: སེམས་ལས་སུ་རུང་བར་གྱུར་ཅིག །
en: May they all have flexible minds.

source: རང་རང་གི་གླིང་བཞི་པ་དག་ན་སངས་རྒྱས་བཞུགས་པ་དག་མཐོང་བར་གྱུར་ཅིག །སེམས་ཅན་དེ་དག་ལ་རིན་པོ་ཆེ་སྣ་ཚོགས་དག་དང་། མེ་ཏོག་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་།
en: May they see the buddhas present in their own four-continent worlds.

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དག་བདོག་པར་གྱུར་ལ། དེས་སེམས་ཅན་དེ་དག་སངས་རྒྱས་དེ་དག་ལ་ཡང་མཆོད་པ་བགྱིད་པར་འགྱུར་ཞིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་གྱུར་ཅིག །
en: May manifold jewels, flowers, incenses, garlands, ointments, powders, parasols, victory banners, and flags appear to all those beings, which they will offer to the buddhas, and may those beings develop the aspiration for the highest, most complete enlightenment.

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་ཏིང་ངེ་འཛིན་སྣང་བ་བཀོད་པའི་མཐུས་བདག་ཉིད་ཀྱིས་མཐོང་བར་གྱུར་ཅིག །
en: Bhagavat, may I see this myself through the power of the array of visions samādhi.’ “

source: ཚིག་དེ་བརྗོད་མ་ཐག་ཏུ་ཇི་ལྟར་སྨོན་ལམ་བཏབ་པ་བཞིན་དུ་བདག་ཉིད་ཀྱིས་མཐོང་བར་གྱུར་པ་དང་།
en: As soon as he said those words, he saw what he had prayed for.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ནི་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཁོ་ར་ཁོར་ཡུག་ཏུ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཁྲི་འཇོག་པར་འགྱུར་རོ། །སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་གི་སེམས་ཀྱི་རྒྱུད་ཡོངས་སུ་དག་པར་བྱེད་པར་ཡང་འགྱུར་རོ།
en: The Bhagavat said, ‘It is excellent, noble son, excellent that you, noble son, will purify ten thousand buddha realms—your own and everywhere around it—and that you will purify the continuum of minds of countless, numberless beings.

source: །དེ་བཞིན་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་ལ་མཆོད་པ་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་བྱེད་པར་སྤྲོ་བར་ཡང་འགྱུར་རོ།
en: Thus you will equal the zeal of making countless, numberless offerings to countless, numberless bhagavat buddhas.

source: །རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ཁྱོད་ཀུན་ཏུ་བཟང་པོ་ཞེས་བྱ་བར་གྱུར་ཅིག །
en: Therefore, noble son, you should be named Samantabhadra.’ “ ‘
